# Pandas

# Remove Duplicate Data:

In [14]:
import pandas as pd
import numpy as np

In [15]:
#Importing Dataset:
df = pd.read_csv('patients.csv')
df

      Height      Weight     BP  Diabetic Gender
0  73.847017  241.893563   98.0       150      M
1  68.781904  162.310473   99.0       145      F
2  74.110105  212.740856  110.0       298    NaN
3        NaN  220.042470    NaN       199      F
4  69.881796  206.349801   97.0       177      F
5  73.847017  241.893563   98.0       150      M
6  68.781904  162.310473   99.0       145      F
7  74.110105  212.740856  110.0       298    NaN
8  74.110105  162.310473  110.0       145      F

In [16]:
df.shape

(9, 5)

In [17]:
df.duplicated() #true only if all comlumns in a row are duplicate

0    False
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8    False
dtype: bool

In [18]:
df.duplicated().sum()

3

In [19]:
df.loc[df.duplicated(), :]

      Height      Weight     BP  Diabetic Gender
5  73.847017  241.893563   98.0       150      M
6  68.781904  162.310473   99.0       145      F
7  74.110105  212.740856  110.0       298    NaN

In [20]:
df.loc[df.duplicated(keep='first'), :] #keep='first' is by default

      Height      Weight     BP  Diabetic Gender
5  73.847017  241.893563   98.0       150      M
6  68.781904  162.310473   99.0       145      F
7  74.110105  212.740856  110.0       298    NaN

In [21]:
df.loc[df.duplicated(keep='last'), :]

      Height      Weight     BP  Diabetic Gender
0  73.847017  241.893563   98.0       150      M
1  68.781904  162.310473   99.0       145      F
2  74.110105  212.740856  110.0       298    NaN

In [22]:
df.loc[df.duplicated(keep=False), :]

      Height      Weight     BP  Diabetic Gender
0  73.847017  241.893563   98.0       150      M
1  68.781904  162.310473   99.0       145      F
2  74.110105  212.740856  110.0       298    NaN
5  73.847017  241.893563   98.0       150      M
6  68.781904  162.310473   99.0       145      F
7  74.110105  212.740856  110.0       298    NaN

### Drop Duplicate

In [23]:
df.drop_duplicates(keep='first').shape

(6, 5)

In [24]:
df.drop_duplicates(keep='first')

      Height      Weight     BP  Diabetic Gender
0  73.847017  241.893563   98.0       150      M
1  68.781904  162.310473   99.0       145      F
2  74.110105  212.740856  110.0       298    NaN
3        NaN  220.042470    NaN       199      F
4  69.881796  206.349801   97.0       177      F
8  74.110105  162.310473  110.0       145      F

In [25]:
df.drop_duplicates(keep='last')

      Height      Weight     BP  Diabetic Gender
3        NaN  220.042470    NaN       199      F
4  69.881796  206.349801   97.0       177      F
5  73.847017  241.893563   98.0       150      M
6  68.781904  162.310473   99.0       145      F
7  74.110105  212.740856  110.0       298    NaN
8  74.110105  162.310473  110.0       145      F

### drop only selected column

In [26]:
df.drop_duplicates(subset = ['Height', 'BP'])

      Height      Weight     BP  Diabetic Gender
0  73.847017  241.893563   98.0       150      M
1  68.781904  162.310473   99.0       145      F
2  74.110105  212.740856  110.0       298    NaN
3        NaN  220.042470    NaN       199      F
4  69.881796  206.349801   97.0       177      F

# Handling Missing Values:

In [27]:
df.isnull() #True if null(NaN) value present

   Height  Weight     BP  Diabetic  Gender
0   False   False  False     False   False
1   False   False  False     False   False
2   False   False  False     False    True
3    True   False   True     False   False
4   False   False  False     False   False
5   False   False  False     False   False
6   False   False  False     False   False
7   False   False  False     False    True
8   False   False  False     False   False

In [28]:
df.isnull().sum() #for True 1 and for False 0 is added

Height      1
Weight      0
BP          1
Diabetic    0
Gender      2
dtype: int64

In [30]:
df[df.Gender.isnull()] #shows complete row where that column value is missing

      Height      Weight     BP  Diabetic Gender
2  74.110105  212.740856  110.0       298    NaN
7  74.110105  212.740856  110.0       298    NaN

### Drop missing value:

In [31]:
df.dropna().shape #drops complete row if any of its value is missing

(6, 5)

In [32]:
df.dropna(how = 'any').shape #how = 'any' is by default

(6, 5)

In [33]:
df.dropna(how = 'all').shape #drops row only if all of its value is missing

(9, 5)

In [34]:
df.dropna(subset = ['Height','BP'], how = 'any').shape

(8, 5)

In [35]:
df['Height'].value_counts() #here it will check how many duplicate values are present excluding missing value

74.110105    3
68.781904    2
73.847017    2
69.881796    1
Name: Height, dtype: int64

In [36]:
df['Height'].value_counts(dropna = False)

74.110105    3
68.781904    2
73.847017    2
69.881796    1
NaN          1
Name: Height, dtype: int64

### Filling missing values:

In [37]:
df['Height'].fillna(value = 100)

0     73.847017
1     68.781904
2     74.110105
3    100.000000
4     69.881796
5     73.847017
6     68.781904
7     74.110105
8     74.110105
Name: Height, dtype: float64

In [38]:
df['Height'].value_counts(dropna = False)

74.110105    3
68.781904    2
73.847017    2
69.881796    1
NaN          1
Name: Height, dtype: int64

### Saving to dataframe

In [39]:
df['Height'].fillna(value = 100, inplace = True)

In [40]:
df['Height'].value_counts()

74.110105     3
68.781904     2
73.847017     2
69.881796     1
100.000000    1
Name: Height, dtype: int64